Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] Ghost King.tmx
Source language: ko_kr
Languages: en_us

source: 정문이 뚫린다!!
en_us: it’s going for the main entrance!

source: 몸으로 느끼는 게야,
en_us: you need to feel your opponent’s movements...

source: 말해주는 게 얼마나 힘들다고 나한테 이런 잡일이나 시키는 거야?
en_us: why is he making me do this? what’s so hard about just telling me?

source: 친한 사람과 같은 조를 짜고싶은 마음은 이해하지만···
en_us: since you only just transferred to an unfamiliar environment…

source: 투투
en_us: Thwack thwack

source: 염원이 이루어지는 순간은 곧 온다.
en_us: my wish will come true soon.

source: 더 필요해···
en_us: I need more…

source: 지지지
en_us: swish

source: 이런 몸으로 무공 배우면 장난 아니겠는데!
en_us: with a body like this, he’ll be legendary with more training!

source: 타다다다닷
en_us: taka taka taka

source: 짜악
en_us: whack

source: 약속대로 본녀의 '흡성대법'을 전수했다.
en_us: as promised, I’ve taught you my fundamental qi absorption technique.

source: 왜 이런 좋은 걸 놔두고 눈알 빠지게 수련했는지···
en_us: why did I even bother training my eyes when something as convenient as this exists…?

source: 삐 리 리 리
en_us: ring

source: 그들과의 비무를 바탕으로 완성된 그의 절초가 바로 '천상반야심공'이다.
en_us: the product of these clashes was the new heavenly prajna arts.

source: 그런 듯합니다.
en_us: that seems to be the case.

source: 한꺼번에 돌돌 말아서 먹었더니 벌써 소화가ꞏꞏꞏ
en_us: it’s already digested ‘cause i twirled it around my chopsticks and ate it all at once...

source: 그리고 그 악인들의 심득은 지하서고에 봉인되었다.
en_us: the insights of the villains were sealed away in the underground library.

source: 보고.
en_us: your report.

source: 세상에···
en_us: oh my gosh…

source: 미친놈아!
en_us: you fool!

source: 히죽
en_us: grunt

source: 옆에서 알짱거리다 베이지 말고.
en_us: stick too close, and you could cut yourself on my sword.

source: 귀령파니까!!
en_us: ...you asked for!!!

source: 어머니!!
en_us: mother!!!

source: 휘오오오오오
en_us: whoosh

source: 정신 차려 임마!
en_us: pull yourself together!

source: 놈이 근처에 있다!
en_us: that bastard is nearby!

source: 뻐
en_us: sm

source: 아니, 저 아저씨 분명 걷고있는데 왜 뛰는 나보다 빠르지?
en_us: wait, he’s walking, while I’m running. why is he faster than me?

source: 타타타타탓
en_us: dash

source: 악인들의 패도적인 무공에 견디지 못한 제자가 광기에 침식되었다.
en_us: ...but his disciple couldn’t withstand their aggressive martial arts and was eaten away by madness.

source: 팔을 더 곧게 뻗어야 제대로 기가 흐르지.
en_us: but his qi would flow better if he straightened his arms.

source: 살수문의 부문주인 저를 살해하려고 한 죄!
en_us: the crime of attempting to murder me, the vice sect leader of the assassin sect!

source: 텅 텅
en_us: dun dun

source: 슈아아아아
en_us: swoosh

source: 이미 늦었나···
en_us: were we too late…?

source: 대체 어디로 간거야?
en_us: taeyeon go, that bastard?

source: 자리에 앉아서 자판만 두들기면 다 나옵니다~
en_us: you can find anything with a few clicks of a button!

source: 첫번째 샘플은 내가 한다.
en_us: I’ll be your first test subject.

source: 아까처럼 반격이라도 해 보시던가!
en_us: try counterattacking like you did earlier!

source: 그래, 흉수는 도주했다는 건가.
en_us: so, you’re saying the criminal escaped.

source: 얘는 이런 데서 대체 뭘 하길래 오라는 거야
en_us: why the heck did he tell me to come here?

source: 흑마관'
en_us: ... also known as the black demon library.

source: 탁탁
en_us: tap tap

source: 그 어떤 것이라도
en_us: ...all of it...

source: 눈에 보이지도 않을 다련타뢰를 전부 간파하고 있어!
en_us: he’s reading the many lotus strike, which he shouldn’t even be able to see!

source: 사라졌어ꞏꞏꞏ?
en_us: he disappeared...?

source: 그럼 그런 걸로~
en_us: it’s decided, then.

source: 꾹
en_us: push

source: 에스제이
en_us: SJ

source: 뭐, 입만 살아?!
en_us: what did you say?!

source: 파 팍
en_us: smack

source: 응ꞏꞏꞏ
en_us: yeah...

source: 어쩔 수 없네!
en_us: but it looks like I have no choice!

source: 내 인생의 목표라ꞏꞏꞏ
en_us: my goal in life...

source: 유지호, 너답지 않군···
en_us: jiho, this isn’t like you…

source: 제대로 알지도 못하면서 나불대지 말란 말이다.
en_us: don’t spout nonsense when you don’t know anything.

source: 에이씨 더러워서
en_us: ugh, it’s filthy

source: 알지.
en_us: I do.

source: 26화
en_us: episode 26

source: 크으으
en_us: grrr

source: 츄우우우우
en_us: shwooo

source: 걱정하시는구나?
en_us: you’re worried about him, aren’t you?

source: 그러면 저 귀령왕의 손자 놈을 이용해 귀령왕을 찾아내는 계획에 차질이 생겨!
en_us: and that will put a snag in my plan to find the ghost king by using his grandson!

source: 내가 넘지 못한 귀령지보 4성의 벽···
en_us: what i needed to get past the fourth star of the treasure of the ghost king…

source: 어···?
en_us: huh…?

source: 내놓아라.
en_us: give it to me.

source: 철사장 진용범
en_us: iron sand palm yongbeom jin

source: 자신이 죽인 악인들의 무공이 소멸하는 것이 아쉬워 시작한 기록이었으나···
en_us: the king started the record because he felt bad about annihilating the martial arts of the villains he’d killed…

source: 커헉
en_us: kugh

source: 촤촷
en_us: slash

source: 흑마서고의 관리자는 나와 대호법 뿐인데, 어째서 이 망나니가 흑마서고를···!
en_us: me and the great guardian are the only ones who handle those books. how did he manage to get his hands on the black demon book…?!

source: 유호법의 여식 답네~
en_us: as expected of guardian yu’s daughter.

source: 나 뿐만이 아니라 화산의 젊은 생도들도 그런생각을 가지고 무당의 무공을 배웠지.
en_us: I wasn’t the only one, either. the young disciples of my sect had the same idea.

source: 두근
en_us: thump

source: 배 이사님, 비상 사태입니다!
en_us: director bae, it’s an emergency!

source: 참나
en_us: scoff

source: 휘이잇
en_us: whoosh

source: 하지만 오늘ꞏꞏꞏ
en_us: but...

source: 시끄러!
en_us: shut up!

source: 더 이상 귀령의 이름으로 살생은 없을 거다.
en_us: there won’t be any more killing in the name of the ghost king under my watch.

source: 부상당한 이기적의 대리로 나선화 학생이 잠시 자리를 대신할 거다.
en_us: seonhwa na will temporarily be taking the place of gijeok lee, who’s been injured.

source: 끄아아아아아
en_us: arghhh

source: 결국 걔도 사람이라 이건다?
en_us: but I guess in the end he’s human, too.

source: 천.
en_us: volving

source: 그, 그럴 순 없습니다.
en_us: y-you can’t.

source: 여지껏 이런 놈들에게 굽신거렸다니,
en_us: i can’t believe we’ve been bowing down to people like them.

source: 결국 넌 태생부터 천한 ㅅ끼였어.
en_us: you really have been inferior since the moment you were born.

source: 귀령왕을 만나기 전에 몸풀기용으로 딱이겠어.
en_us: you’ll be a good warm-up for me before I face the ghost king.

source: 이자식, 내 공격을 이렇게 가볍게ꞏꞏꞏ
en_us: my attacks have nothing on this bastard...

source: 형도 이 상황이 잘못됐다는 거 잘 알잖아!
en_us: you know how wrong this is!

source: 뭐라ꞏꞏꞏ
en_us: what...?

source: 흑익사홍문
en_us: blackest deceit sect

source: 대신 꼭 알려주셔야해요, 아빠에 대해서!
en_us: in exchange, you have to promise to tell me about my dad!

source: 사실 마샴바란 악신은 전륜법궁의 시조인 전륜법왕이 창조한 무공 천상반야신공이 어두운 그림자로
en_us: in reality, the evil god mashamba was one of the disciples of the king and progenitor of the revolution palace who took care of recording the king’s insights...

source: 착각하지 마라 강태연.
en_us: don’t fool yourself, taeyeon kang.

source: 내 부탁 하나만 들어줘라!
en_us: do me a favor!

source: 사파의 정점은 살수문이 된다!
en_us: ...the assassin sect will be at the pinnacle of the evil faction!

source: 이예린
en_us: yerin lee

source: 쿠쿠쿠쿠쿠
en_us: rumble

source: 히히
en_us: hehe

source: 지, 지호 선배?!
en_us: j-jiho seonbae?!

source: 서, 선배 이건 그러니깐 정말로 전 아무것도···
en_us: s-seonbae, there really isn’t anything going on between…

source: 왜 하나밖에 없지?
en_us: why is there only one?

source: 잠깐 얘기좀···
en_us: I wanna talk to you for a second…

source: 도망쳐!!
en_us: run!!!

source: 얼마 못버티겠군.
en_us: he probably won’t last long.

source: 홍대방!
en_us: daebang hong!

source: 덤벼봐!
en_us: bring it on!

source: 엄마가 말했던 주의사항에 싹 다 해당되는 애잖아!
en_us: this girl is everything my mom warned me about!

source: 토르카!!
en_us: torka!!!

source: 기대해 보시죠 장문인.
en_us: just you wait, sect leader.

source: 주문하신 거 나왔습니다.
en_us: order up.

source: 요놈 몸 좀 봐라?
en_us: would you look at that body?

source: 내가 널 쓰러뜨린다.
en_us: ...I’ll defeat you today.

source: 가져와.
en_us: bring it here.

source: 왜, 벌써 찾은건가?
en_us: what, have you found him already?

source: 만개
en_us: full bloom

source: 상대의 움직임을!
en_us: ...with your body!

source: 타 탕
en_us: thunk

source: 츄우우우
en_us: swoosh

source: 13호, 가서 노크 좀 하고 와라.
en_us: 13, go knock on the door.

source: 퍼퍼퍼퍽
en_us: slice slice dice

source: 중원에서는 귀령이라 불리는 모양이더군.
en_us: however, it appears that the central nations call him the ghost.

source: 라면을 한꺼번에 돌돌 말았던 것처럼ꞏꞏꞏ
en_us: l’ll gather my qi...

source: ㅇㄷ냐?
en_us: where are you?

source: 뭐라고요?
en_us: excuse me?

source: 몸 구석구석 혈관을 타고 기가 스며드는 기분이다.
en_us: the qi feels like it’s spreading throughout my body.

source: 거의 완성 단계지만 아직 샘플로 사용할 고수를 구하지 못해···
en_us: it’s almost complete, but we’ve yet to obtain martial arts masters to use as test subjects…

source: 어, 지호 선배다.
en_us: oh, it’s jiho seonbae.

source: 내가 그리는 투로를 잘 봐,
en_us: watch my form.

source: 무경대 뒤편 쓰레기 하치장
en_us: behind murim police university garbage dump

source: 흑사맹 본산의 지하
en_us: the basement of the black death sect’s main base...

source: 너 따윈 내 상대가 될 수 없다.
en_us: someone like you can never be my opponent.

source: 화산파의 장문인 '화산일검 이기문'
en_us: the leader of the flower mountain sect and the sword of the flower mountain, gimun lee.

source: 어제같이 도움은커녕 걸리적거리기만 해선 답이 없어.
en_us: I can’t keep being helpless like I was yesterday.

source: 법의의 주박을 풀어냈단 말인가!
en_us: does this mean he broke the shackles of justice?

source: 어휴~ 지금이 무슨 세상인데 일일이 돌아다니면서 찾습니까?
en_us: ugh, who goes around looking for people in this day and age?

source: 우리 아빠, 지금 어디 계신지!
en_us: ...where my dad is!

source: 의문은 뒤로 밀어두자.
en_us: let’s leave my questions for later.

source: ※대막 :{j}몽골
en_us: daemak is a term that refers to the gobi desert.

source: 찌익
en_us: rip

source: 꺄악!!
en_us: kyaaa!!!

source: 결국 귀령파도 기를 모아 방출하는 장력의 일종ꞏꞏꞏ
en_us: ultimately, the ghostly spirit wave is an explosive release of qi...

source: 영구야, 밖에 차 좀 대기시켜놔라.
en_us: yeong-gu, get the car ready.

source: 빈틈!
en_us: an opening!

source: 죽여!!
en_us: kill him!!!

source: 새외사궁이 중원에 개입이라도 했다는 말인가?
en_us: are you saying that the outer nations got involved in the central region’s matters?

source: 너 같은 얼빠진 놈이 귀령의 후손이라니ꞏꞏꞏ
en_us: to think a blockhead like you is the descendant of the ghost king...

source: 방금 내가 한 개 더 넣었으니까 두 개여야 하는데?
en_us: shouldn’t there be two since I swept one in earlier?

source: 좋아, 이번엔 좀 더 기를 많이 끌어모아서ꞏꞏꞏ
en_us: all right, let’s try gathering more qi this time...

source: 따라와 나선화, 긴급사태다!
en_us: follow me, seonhwa. this is an emergency!

source: 기?
en_us: qi?

source: 야 지금 빨리 학교 앞XX골목 지하주차장 으로 와라 급하다!
en_us: come to the underground parking lot at xx alley. it’s urgent!

source: 타다닥
en_us: taka taka

source: 자신의 길을 강요하고 시대를 역행하는 혹독한 수련으로 나를 괴롭게 했지.
en_us: he forced his own beliefs on me and put me through harsh, old-fashioned training.

source: 흑마공 10성 흑사우주ꞏꞏꞏ
en_us: 10th star of the black demon art, red wings of the black snake...

source: 그렇게 알려져 있었지만···
en_us: that’s the story everyone knows…

source: 손고후
en_us: gohoo son

source: 역시, 심장 주변 혈들이 전부 엉망 진창이다.
en_us: just like I thought, the veins around his heart are a complete mess.

source: 미얀 토야···
en_us: I’m sorry, toya…

source: 당연히 화산파의 장문을 이어받을거라 생각했고
en_us: I never doubted that I’d inherit the leadership.

source: 토르···
en_us: torka…

source: 흑마서고를 찾는다고 무리를 해버렸어.
en_us: I overexerted myself while trying to find the black demon book.

source: 천한 놈이지.
en_us: ...of being born to your plaything.

source: 지금이야말로 사파를 엎을 기회다!
en_us: now is my chance to overthrow the black death sect!

source: 귀, 귀령의 힘?!
en_us: th-the power of the ghost king?!

source: 형님, 피하세요!!
en_us: hyeong, watch out!

source: 아저씨, 솔직히 말해봐요.
en_us: mister, be honest with me.

source: 일어나라 토르카!
en_us: get up, torka!

source: 하여간, 드럽게 약한 ㅅ끼들이 입만 살아가지고,
en_us: all you pieces of sh*t do is talk big.

source: 실망이군.
en_us: what a disappointment.

source: 직
en_us: crunch

source: 움직임이 안 보였ꞏꞏꞏ
en_us: I didn’t even see him move...

source: 후루룹
en_us: slurp

source: 툭
en_us: thunk

source: 이제껏 우리가 쫓던 놈은 상대의 단전만을 파괴해왔다.
en_us: the guy we’ve been chasing has only been destroying his opponents’ lower abdomens.

source: 터 엉
en_us: wham

source: 감히 나를 상대로 먹튀를 했단 말이야?
en_us: how dare he leave me hanging?

source: 잉?
en_us: huh?

source: 이기적 ㅈ나 눈치없는 ㅅ끼ꞏꞏꞏ
en_us: ugh, gijeok lee, you insensitive bastard...

source: 이것이, 살수문을 지탱하는 힘이란다.
en_us: this is the power underlying the assassin sect.

source: 타 앙
en_us: kick

source: 정신차려 이ㅅ꺄!
en_us: pull yourself together, you bastard!

source: 절호의 찬스에서 망설인 건가?
en_us: did he hesitate at that golden opportunity?

source: 형, 제발 할아버지를 말려봐!
en_us: hyeong, please stop grandfather!

source: 큭, 이런 가공할 만한 위력이라니···
en_us: ugh, to think he had such terrifying power…

source: 흑마왕이 자랑하던 사파 최강의 뒷면은 사실 썩어문드러진 빈수레 그 자체.
en_us: the strongest sect in the evil faction, the pride of the black demon king, is actually a rotten and empty wagon.

source: 가라, 마무리 필살기 선봉익!!
en_us: I’m gonna finish you with spinning phoenix wings!

source: 지렁이도 밟으면 꿈틀 덴다는 거냐?
en_us: I guess even a worm will put up a fight if you step on it, no matter how futile.

source: 귀.
en_us: ghostly

source: 츳
en_us: clench

source: 쓰레기가 빗자루를 피해 간다!
en_us: the trash is avoiding the broom!

source: 귀령파 맞고 뒈질까 봐 일부러 걔를 방패 삼은 거잖아!
en_us: you’re using him as a shield because you’re scared I’ll kill you with it!

source: 남 매 식 당
en_us: siblings restaurant

source: 아, 흑마왕님···
en_us: ah, black demon king…

source: 촤하악
en_us: splatter

source: 크, 크큭···
en_us: hehe…
